#!/usr/bin/perl -w
package Jum::Text;
use strict;
use warnings;

=head1 Операции с текстом

На момент написания модуля то, что было в CPAN, работало достаточно непредсказуемо
и не очень хорошо - проще было вынести свою библиотеку для простых операций с текстом.

=cut

sub trim {
    my $string = shift;
    if(ref($string) eq q[SCALAR]){
        $$string =~ s/^[\s\t]*//s;
        $$string =~ s/[\s\t]*$//s;
        return;
    }
    $string =~ s/^[\s\t]*//s;
    $string =~ s/[\s\t]*$//s;
    return $string;    
}

our %letters = (
    'а' => 'a',
    'б'  =>  'b',
    'в'  =>  'v',
    'г'  =>  'g',
    'д'  =>  'd',
    'е'  =>  'e',
    'ё'  =>  'e',
    'ж'  =>  'j',
    'з'  =>  'z',
    'и'  =>  'i',
    'й'  =>  'i',
    'к'  =>  'k',
    'л'  =>  'l',
    'м'  =>  'm',
    'н'  =>  'n',
    'о'  =>  'o',
    'п'  =>  'p',
    'р'  =>  'r',
    'с'  =>  's',
    'т'  =>  't',
    'у'  =>  'u',
    'ф'  =>  'f',
    'х'  =>  'h',
    'ц'  =>  'z',
    'ч'  =>  'ch',          
    'ш'  =>  'sh',
    'щ'  =>  'sh',
    'ъ'  =>  'j',
    'ы'  =>  'y',
    'ь'  =>  'j',
    'э'  =>  'e',
    'ю'  =>  'u',
    'я'  =>  'ja',
    'А' => 'A',
    'Б'  =>  'B',
    'В'  =>  'V',
    'Г'  =>  'G',
    'Д'  =>  'D',
    'Е'  =>  'E',
    'Ё'  =>  'E',
    'Ж'  =>  'J',
    'З'  =>  'Z',
    'И'  =>  'I',
    'Й'  =>  'I',
    'К'  =>  'K',
    'Л'  =>  'L',
    'М'  =>  'M',
    'Н'  =>  'N',
    'О'  =>  'O',
    'П'  =>  'P',
    'Р'  =>  'R',
    'С'  =>  'S',
    'Т'  =>  'T',
    'У'  =>  'U',
    'Ф'  =>  'F',
    'Х'  =>  'H',
    'Ц'  =>  'Z',
    'Ч'  =>  'Ch',
    'Ш'  =>  'Sh',
    'Щ'  =>  'Sh',
    'Ъ'  =>  'J',
    'Ы'  =>  'Y',
    'Ь'  =>  'J',
    'Э'  =>  'E',
    'Ю'  =>  'U',
    'Я'  =>  'Ja',    
);


sub utf2translit {
    my $string = shift;
    foreach my $letter (keys %letters){
        $string =~ s/$letter/$letters{$letter}/g;
    }
    return $string;
}


1;